**QUESTION 1**

---



The collection datatypes in Python are:

> List: the most general version of a sequence in Python. They are mutable, meaning the elements inside a list can be changed. List items are ordered, changeable, and allow duplicate values.

> Tuple: similar to lists, however, tuples are immutable meaning they can not be changed after they are created. We use tuples to present things that shouldn't be changed, such as days of the week, or dates on a calendar.

> Dictionary: used to store data values in key: value pairs. Dictionary items are ordered, changeable, do not allow duplicates and can be in any data type.

> Set: used to store multiple items in a single variable. A collection which is both unordered and unindexed.

In [ ]:
import pandas as pd

In [ ]:
data_dict= {'name': ['Nancy', 'Andrew', 'Janet', 'Margeret', 'Steven'], 'monthly_salary':[5000, 4000, 6000, 3000, 2000], 'zip':[98122, 98401, 98033, 98052, 98051]}
emp_df= pd.DataFrame(data_dict)

In [ ]:
print(emp_df)

       name  monthly_salary    zip
0     Nancy            5000  98122
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margeret            3000  98052
4    Steven            2000  98051

**QUESTION 2**

---

In [ ]:
emp_df.head()

       name  monthly_salary    zip
0     Nancy            5000  98122
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margeret            3000  98052
4    Steven            2000  98051

**QUESTION 3**

---

In [ ]:
print(emp_df.iloc[0,:])

name              Nancy
monthly_salary     5000
zip               98122
Name: 0, dtype: object

**QUESTION 4**

---

In [ ]:
print(emp_df.iloc[4,:])

name              Steven
monthly_salary      2000
zip                98051
Name: 4, dtype: object

**QUESTION 5**

---

In [ ]:
print('The shape of emp_df is:', emp_df.shape)
print('The size of emp_df is:', emp_df.size)

The shape of emp_df is: (5, 3)
The size of emp_df is: 15

**QUESTION 6**

---

In [ ]:
print('The average salary of all employees is: ',emp_df['monthly_salary'].mean(axis=0))

The average salary of all employees is:  4000.0

**QUESTION 7**

---

In [ ]:
emp_df.sort_values(by='name')

       name  monthly_salary    zip
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margeret            3000  98052
0     Nancy            5000  98122
4    Steven            2000  98051

**QUESTION 8**

---

In [ ]:
temp=emp_df[emp_df['zip']==98033]

    name  monthly_salary    zip
2  Janet            6000  98033

In [ ]:
temp

    name  monthly_salary    zip
2  Janet            6000  98033

**QUESTION 9**

---

In [ ]:
emp_df["annual_salary"] = emp_df["monthly_salary"] * 12

In [ ]:
emp_df.head()

       name  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margeret            3000  98052          36000
4    Steven            2000  98051          24000

**QUESTION 10**

---

In [ ]:
emp_df.rename(columns={'name':'firstname'},inplace=True)

In [ ]:
emp_df

  firstname  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margeret            3000  98052          36000
4    Steven            2000  98051          24000

**QUESTION 11**

---

In [ ]:
emp_info=emp_df[['firstname','annual_salary','zip']].copy()

In [ ]:
emp_info

  firstname  annual_salary    zip
0     Nancy          60000  98122
1    Andrew          48000  98401
2     Janet          72000  98033
3  Margeret          36000  98052
4    Steven          24000  98051

**QUESTION 12**

---

In [ ]:
print(emp_info['firstname'])

0       Nancy
1      Andrew
2       Janet
3    Margeret
4      Steven
Name: firstname, dtype: object

**QUESTION 13**

---

In [ ]:
emp_info.drop(columns=['annual_salary'])

  firstname    zip
0     Nancy  98122
1    Andrew  98401
2     Janet  98033
3  Margeret  98052
4    Steven  98051